<a href="https://colab.research.google.com/github/stephyi/10Academy/blob/master/Essentials_SQL_Notebook_SQL_Basics_for_Data_Science.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Essentials SQL Notebook - SQL Basics for Data Science

## Connecting to our database

In [ ]:
# We will start our practice work by first loading an sql extension. 
# Notebook extensions are simple add-ons that extend the basic functionality 
# of the notebook environment. This extension will allow us to run SQL code in our Notebook.
# ---
#
%load_ext sql

In [ ]:
# We then connect to an in memory SQLite database within colaboratory. 
# This in memory dataset will be deleted as soon the dataset connection is lost, 
# meaning when our connection to the servers is disconnected then our database will cease to exist.
# ---
#  
%sql sqlite://

## 1. Loading our dataset

In [ ]:
# To read our csv file from an external source into our colaboratory environment, 
# we will use the pandas library for data maninupation. So, let's load it.
# Don't worry about this library now, we will cover it in future sessions.
# ---
#
import pandas as pd

### <font color="blue">Example</font>

In [ ]:
# Example 
# ---
# We will load our first dataset from a csv file as shown and afterwords, 
# store that dataset in our in memory sqlite database.
# ---

# We read our dataset from its source and store it in a dataframe called cities.
# ---
#
cities = pd.read_csv('http://bit.ly/CItiesDB') 

# We then delete the table if it exists in our database
# ---
#
%sql DROP TABLE if EXISTS cities;

# We then store this table in a table called 'cities' within our in memory dataset.
# The persist command that we will create will help us do this. 
# NB: The table name will be the same as variable name above.
# ---
#
%sql PERSIST cities;

# We can then select the first five records of our created cities table.
# This will help us know whether our table was created.
# ---
#
%sql SELECT * FROM cities LIMIT 5;

### <font color="green">Challenge</font>

In [ ]:
# Challenge: 
# ---
# Question: Load and check the countries dataset from the following url
# ---
# Dataset url = http://bit.ly/CountriesDB1
# ---
# YOUR CODE GOES BELOW
# ---
#

## 2. Selecting data from a table

###<font color="blue">Examples</font>

In [ ]:
# Example 1: We can select all records from a columns as shown:
# ---
# Selecting all records from the temperature column.
# ---
#
%%sql
SELECT temperature FROM cities;

In [ ]:
# Example 2: We can limit the no. of fetched records using the LIMIT keyword as shown:
# ---
#
%%sql
SELECT temperature FROM cities LIMIT 5;

In [ ]:
# Example 3: We can select distinct items from a single column using the DISTINCT keyword as shown:
# ---  
#
%%sql
SELECT DISTINCT country FROM cities;

In [ ]:
# Example 4: We can use conditions to select records through the use of the WHERE clause as shown:
# ---  
# 
%%sql
SELECT * FROM cities WHERE country = 'Sweden';

In [ ]:
# Example 5: We can order our records through the use of the ORDER BY clause and using ASC or DESC as shown:
# ---  
# 
%%sql
SELECT * FROM cities WHERE country = 'Sweden' ORDER BY temperature ASC;

In [ ]:
# Example 6: We can count selected items through the use of COUNT() function as shown:
# --- 
# 
%%sql
SELECT count(*) 
FROM cities 
WHERE country = 'Sweden' 
ORDER BY temperature 
ASC;

In [ ]:
# Example 7
# ---
# We select records with values between certain boundaries in a column through
# the BETWEEN AND keywords as shown:
# ---
# 
%%sql
SELECT * FROM cities 
WHERE temperature 
BETWEEN 17 AND 20 
ORDER BY country 
DESC;

In [ ]:
# Example 8
# ---
# We select records between certain boundaries and not have having certain values 
# in a column using the AND NOT keywords as shown:
# ---
# 
%%sql
SELECT * 
FROM cities 
WHERE temperature 
BETWEEN 17 AND 20 
AND NOT longitude < 10
ORDER BY country DESC;

In [ ]:
# Example 9
# ---
# We can select records without null values as shown below:
# ---
#
%%sql
SELECT * FROM cities WHERE temperature IS NULL;

In [ ]:
# Example 10
# ---
# We can again select records with no null values as shown:
# ----
# This time we limit the fetched records because 
# we might expect to have many records returned.
# ---
# Challenge: You can also change the code to counting how many records 
# we have using the COUNT() keyword.
# ---
#
%%sql
SELECT * FROM cities 
WHERE temperature IS NOT NULL LIMIT 5;

In [ ]:
# Example 11
# ---
# We can select multiple fields FROM a table as shown. 
# ---
#  
%%sql
SELECT city, temperature FROM cities 
ORDER BY temperature DESC 
LIMIT 5;

### <font color="green">Challenges</font>

<font color="blue">Your will be required to use countries dataset that you loaded in the first challenge earlier.</font>

In [ ]:
# Challenge 1
# ---
# Question: Select the first 5 records from the countries dataset.
# ---
# YOUR CODE GOES BELOW 
#

In [ ]:
# Challenge 2
# ---
# Question: How many countries are there in the eu from the given countries dataset?
# ---
# YOUR CODE GOES BELOW 
#

In [ ]:
# Challenge 3
# ---
# Question: Which countries had a population less than 3.0 and had a coastline?
# ---
# YOUR CODE GOES BELOW 
#

In [ ]:
# Challenge 4
# ---
# Question: Which countries had the most population but were not in the eu?
# ---
# YOUR CODE GOES BELOW 
#

In [ ]:
# Challenge 5
# ---
# Question: Which three eu countries have the least population?
# ---
# YOUR CODE GOES BELOW 
#

In [ ]:
# Challenge 6
# ---
# Question: Does your countries dataset have any missing records?
# ---
# YOUR CODE GOES BELOW 
#

## 3. Inserting data to a table

### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# Then we will insert new data into our table and noting the added record 
# city        = 'Palanga'
# country     = 'Lithuania'
# latitude    = '22'
# longitude   = 12.1
# temperature = 21 
# ---
#
%%sql
INSERT INTO cities (city, country, latitude, longitude, temperature)
VALUES ('Palanga', 'Lithuania', 22, 12.1, 15);

SELECT * FROM cities WHERE city = "Palanga";

In [ ]:
# Example 2
# ---
# Then we will insert new data into our table and noting all the values of the added record
# city        = 'Prizren'
# country     = 'Kosovo'
# latitude    = '22' 
# ---  
# 
%%sql
INSERT INTO cities (city, country, latitude)
VALUES ('Prizren', 'Kosovo', 22);

SELECT * FROM cities WHERE city = "Prizren";

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Insert the following data into our countries table.
# country    = 'Kosovo'
# population = '2'
# eu         = no
# coastline  = no
# ---
#

## 4. Updating data in a table

### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# Let's update a record in our cities table
# ---
# 
%%sql
UPDATE cities
SET temperature = 3.0
WHERE country = "Albania";

SELECT * FROM cities WHERE country = "Albania";

In [ ]:
# Example 2
# ---
# Let's update a record in our cities tables
# ---
#
%%sql
UPDATE cities
SET latitude = 41.12, longitude = 20.09
WHERE "city" = "Elbasan";

SELECT * FROM cities WHERE country = "Albania";

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Update the population of Austria to 9.0 in the countries table.
# --- 
# YOUR CODE GOES BELOW
#

## 5. Performing calculations with SQL

### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# We can find the average by using the AVG() function as shown
# ---
# 
%%sql
SELECT MAX(temperature) FROM cities;

In [ ]:
# Example 2
# ---
# Which city had the highest temperature?
# ---
# 
%%sql 
SELECT city, MAX(temperature) FROM cities;

In [ ]:
# Example 3
# ---
# Find the average temperature for each country
# ---
# 
%%sql
SELECT country, AVG(temperature)
FROM cities
GROUP BY country

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: What is the average population of EU with a coastline?
# ---
# YOUR CODE GOES BELOW
#

In [ ]:
# Challenge 2
# ---
# Question: Which EU cities had temperature above the average? 
# ---
# YOUR CODE GOES BELOW
#

In [ ]:
# Challenge 3
# ---
# Which EU country had the lowest population?
# ---
# YOUR CODE GOES BELOW
#

## 6. Creating SQL tables

### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# As we had seen, we can create a table using the following create table statement.
# If the table doesn't exist, then we create a table with the columns; 
# store_id, name, owner, description, phone, opening_date.
# --- 
#
%%sql 
CREATE TABLE IF NOT EXISTS stores (
    store_id, 
    name, 
    owner, 
    description, 
    phone,
    opening_date
);

In [ ]:
# We will then use the SELECT statement to check whether the table has been created. 
#  - Don't worry about the SELECT statement, we will get to practice 
#    more how to use it. For now, just know that statement SELECTs
#    all the records in the specified table.
#  - We use a single % to execute a single sql statement in our notebook environment as shown
# ---
%sql SELECT * FROM stores;

In [ ]:
# Example 2
# ---
# While creating our table we can also specify different 
# data types as shown below;  
#
%%sql 
CREATE TABLE IF NOT EXISTS stores_two (
    store_id int, 
    name varchar(60), 
    owner varchar(60), 
    description text, 
    phone varchar(15),
    opening_date date 
); 
SELECT * FROM stores_two;

In [ ]:
# Example 3
# ---
# We can also specify default values while creating our table 
# by use the default keyword as shown below 
# 
%%sql 
CREATE TABLE IF NOT EXISTS stores_three (
    store_id int primary key, 
    name varchar(60), 
    owner varchar(60) default 'Unknown', 
    description text, 
    phone varchar(15),
    opening_date date 
); 
SELECT * FROM stores_three;

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Create a table named televisions with the following fields; 
# name, model, company, screen, price, warranty. 
# ---
# YOUR CODE GOES BELOW
# 
%%sql

In [ ]:
# Challenge 2
# ---
# Question: Create a table called staff that stores staff_number, name, 
# department, salary, phone, address using appropriate data types,
# applying the appropriate datatype and default value of "unknown" for
# for the field phone.
# --- 
# YOUR CODE GOES BELOW
#

## 7. Altering SQL tables

### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# The name of a table can be changed by doing the following.
# and again check whether our change was made by using the 
# SELECT statement.
# ---
#
%%sql  
ALTER TABLE stores RENAME TO supermarket_stores;

SELECT * FROM supermarket_stores;

In [ ]:
# Example 2
# ---
# We can add a field by doing the following.
# Then check whether our new field was added to the 
# specified table by doing the following.
# ---
#
%%sql 
ALTER TABLE supermarket_stores ADD country;
 
SELECT * FROM supermarket_stores;

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Rename the table televisions to tvs
# ---
# YOUR CODE GOES BELOW
#

In [ ]:
# Challenge 2
# ---
# Add a field description with the data type text to televisions table 
# ---
# YOUR CODE GOES BELOW
#

## 8. Dropping a table

### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# We can drop (or delete) our table as shown below
# ---
# 
%sql DROP TABLE supermarket_stores;

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Drop the tvs table from our database
# ---
# YOUR CODE GOES BELOW
#